'use strict';
// =============================================================
// math_functions
// Математические функции
// =============================================================

define([], function(){
    var degToRad, // Преобразование градусов в радианы
        radToDeg, // Преобразование радиан в градусы
        fac, // Факториал числа
        doubleFac, // Двойной факториал числа
        sgn, // Сигнум
        arch, // Ареакосинус
        arsh, // Ареасинус
        ch, // Гиперболический косинус
        sh; // Гиперболический синус



    // =============================================
    // degToRad
    // =============================================
    // Преобразование градусов в радианы
    // Пример:
    // console.log("Синус 30° = " + Math.sin(degToRad(30)));
    function degToRad (deg){
        return deg / 180 * Math.PI;
    };



    // =============================================
    // radToDeg
    // =============================================
    // Преобразование радиан в градусы
    // Пример:
    // console.log("Арктангенс √3 = " + radToDeg(Math.atan(Math.sqrt(3))) + "°");
    function radToDeg (rad){
        return rad / Math.PI * 180;
    };



    // =============================================
    // fac
    // =============================================
    // Функция возвращяющая факториал числа 'n'
    fac = function(n) {
        var result = 1;

        n = Math.abs(n);

        if (n === 0) return 1;

        while (n--){
            result = result * (n + 1);
        };

        return result;
    };



    // =============================================
    // doubleFac
    // =============================================
    // Функция возвращяющая двойной факториал числа 'n'
    doubleFac = function(n){
        var result;

        n = Math.abs(n);

        if (n === 0) return 1;

        if (n & 1) { // n - нечётное
            result = fac(n) / ( Math.pow(2,(n - 1) / 2) * fac((n - 1) / 2) );
        } else { // n - чётное
            result = Math.pow(2, n / 2) * fac(n / 2);
        };

        return result;
    };



    // =============================================
    // sh
    // =============================================
    // Гиперболический синус
    sh = function(x){
        return (Math.exp(x) - Math.exp(-x)) / 2;
    };



    // =============================================
    // ch
    // =============================================
    // Гиперболический косинус
    ch = function(x){
        return (Math.exp(x) + Math.exp(-x)) / 2;
    };



    // =============================================
    // arch
    // =============================================
    // Ареакосинус - обратный гиперболический косинус, гиперболический арккосинус
    arch = function(x){
        if (x < 1) {
            return undefined;
        };

        return Math.log(x + Math.sqrt(Math.pow(x, 2) - 1));
    };



    // =============================================
    // arsh
    // =============================================
    // Ареасинус - обратный гиперболический синус, гиперболический арксинус
    arsh = function(x){
        return Math.log(x + Math.sqrt(Math.pow(x, 2) + 1));
    };



    // =============================================
    // sgn
    // =============================================
    // Сигнум - кусочно-постоянная функция действительного аргумента.
    sgn = function(x){
        if (x > 0) {  return 1;  };
        if (x < 0) {  return -1;  };
        return 0;
    };




    return {
        degToRad: degToRad,   // Преобразование градусов в радианы
        radToDeg: radToDeg,   // Преобразование радиан в градусы
        fac: fac,             // Факториал числа
        doubleFac: doubleFac, // Двойной факториал числа
        sgn: sgn,             // Сигнум
        arch: arch,           // Ареакосинус
        arsh: arsh,           // Ареасинус
        ch: ch,               // Гиперболический косинус
        sh: sh                // Гиперболический синус
    };

});